Console.WriteLine(
    "Задача: Написать программу, которая из имеющегося массива строк формируст массив из строк, длина которых \n"
    + "меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте \n"
    + "выполнения алгоритма. При решении но рекомендуется пользоваться коллекциями, лучше обойтись \n"
    + "исключительно массивами.");
Console.WriteLine();
